Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Virtual threads occupy less space than platform threads in memory. Hence, it becomes possible to use more virtual threads than platform threads simultaneously without blowing up the heap. By default, platform threads are created with a stack of about 1 MB where virtual threads stack is "pay-as-you-go". You can find these numbers along with other motivations for virtual threads in this presentation given by the lead developer of project Loom: https://youtu.be/lIq-x_iI-kc?t=543.
ja_jp: 仮想スレッドはプラットフォームスレッドよりもメモリ上で占有する領域が小さくなります。したがってヒープを爆発させずにプラットフォームスレッドよりも多くの仮想スレッドを同時に使用することが可能になります。デフォルトでは、プラットフォームスレッドは約1MBのスタックで作成され、仮想スレッドのスタックは"使った分だけ"です。これらの数字と仮想スレッドの他の論拠はLoomプロジェクトのリードディベロッパーが行ったプレゼンテーションで知ることができます: https://youtu.be/lIq-x_iI-kc?t=543 。

source: Virtual threads occupy less space than platform threads in memory. Hence, it becomes possible to use more virtual threads than platform threads simultaneously without blowing up the memory. By default, platform threads are created with a stack of about 1 MB, whereas virtual threads stack is "pay-as-you-go." You can find these numbers and other motivations for virtual threads in this https://youtu.be/lIq-x_iI-kc?t=543[presentation] given by the lead developer of project Loom (the project that added the virtual thread support to the JVM).
ja_jp: 仮想スレッドは、プラットフォームスレッドよりもメモリー上の占有領域が小さくなります。 したがって、メモリーを消費することなく、プラットフォームスレッドよりも多くの仮想スレッドを同時に使用することが可能になります。 デフォルトでは、プラットフォームスレッドは約 1MB のスタックで作成されますが、仮想スレッドのスタックは "pay-as-you-go "です。 Loom プロジェクト (JVM に仮想スレッドサポートを追加したプロジェクト) のリード開発者が行った link:https://youtu.be/lIq-x_iI-kc?t=543[プレゼンテーション] で、これらの数字や仮想スレッドの他の動機を見つけることができます。

source: Virtual threads on the other hand are managed by the JVM. In order to be executed, they need to be mounted on a platform thread (which acts as a carrier to that virtual thread). As such, they have been designed to offer the following characteristics:
ja_jp: 一方で仮想スレッドはJVMによって管理されます。実行するにはプラットフォームスレッド（その仮想スレッドのキャリアとして機能する）にマウントされる必要があります。なので次のような特徴を持つように設計されています:

source: Virtual threads, on the other hand, are managed by the JVM. To be executed, they need to be mounted on a platform thread (which acts as a carrier to that virtual thread). As such, they have been designed to offer the following characteristics:
ja_jp: 一方、仮想スレッドは JVM によって管理されます。実行するには、(その仮想スレッドのキャリアーとして機能する) プラットフォームスレッドにマウントする必要があります。 そのため、以下のような特徴があります。

source: Virtual-Threads version
ja_jp: 仮想スレッドバージョン

source: Visibility of `src/main/resources/application.properties` in test as discussed in https://groups.google.com/g/Quarkus-dev/c/xCU6Yvw__ks/m/cogHVvNsAwAJ[this thread]; A lot of work has been done since then such as "Use AbstractLocationConfigSourceLoader to load application.properties and application.yaml" https://github.com/quarkusio/quarkus/pull/15282[#15282], so I need to recheck
ja_jp: https://groups.google.com/g/Quarkus-dev/c/xCU6Yvw__ks/m/cogHVvNsAwAJ[このスレッド] で議論されているように、テストにおける `src/main/resources/application.properties` の可視性; 以来、"Use AbstractLocationConfigSourceLoader to load application.properties and application.yaml" https://github.com/quarkusio/quarkus/pull/15282[#15282] など、多くの作業が行われてきました、そのため、再チェックが必要です

source: Visit http://localhost:8080/hello/names. Instead of a list of names, you'll get a red error screen. In the terminal where Quarkus is running. you'll see the following stack error message:
ja_jp: http://localhost:8080/hello/names にアクセスします。名前のリストの代わりに、 Quarkus が実行されているターミナルに赤いエラー画面が表示されます。 以下のスタックエラーメッセージが表示されます。

source: Visit http://localhost:8080/hello?name=Bloom.
ja_jp: http://localhost:8080/hello?name=Bloom にアクセスします。

source: Visit the https://docs.microsoft.com/cli/azure/install-azure-cli?view=azure-cli-latest?WT.mc_id=opensource-quarkus-brborges[Azure CLI] installation page for instructions specific to your operating system.
ja_jp: お使いのオペレーティングシステムに固有の手順については、 link:https://docs.microsoft.com/cli/azure/install-azure-cli?view=azure-cli-latest?WT.mc_id=opensource-quarkus-brborges[Azure CLI] のインストールページを参照してください。

source: Visual Studio Code extension to install using the marketplace
ja_jp: マーケットプレイスを使用してインストールするVisual Studioのコードエクステンション

source: Visualize and configure extensions as well as access to application logs and testing components
ja_jp: エクステンションの可視化と設定だけでなく、アプリケーションログやテストコンポーネントへのアクセスが可能

source: Visualizing build step dependencies
ja_jp: ビルドステップの依存関係の可視化

source: Visualizing records
ja_jp: レコードの可視化

source: Visualizing the data
ja_jp: データの可視化

source: WARN: Jakarta Data only works with stateless sessions, though it does support blocking and reactive variants.
ja_jp: 警告: Jakarta Data はステートレスセッションでのみ動作しますが、ブロッキングおよびリアクティブのバリアントをサポートしています。

source: WARN: you can also store passwords in clear text with `@Password(PasswordType.CLEAR)` but we strongly recommend against it in production.
ja_jp: 警告: `@Password(PasswordType.CLEAR)` を使ってパスワードをクリアテキストで保存することもできますが、本番では絶対にしないことを強くお勧めします。

source: WASM/WASI support
ja_jp: WASM/WASI サポート

source: Wait a minute. What does "container-managed" mean?
ja_jp: ちょっと待ってください。「コンテナーで管理された」とはどういう意味ですか?

source: Wait a second! The server restarted by itself after the `WeatherForecastService` update? Yes, this is one of Quarkus amazing features for developers called `live coding`.
ja_jp: ちょっと待って!? `WeatherForecastService` のアップデート後、サーバーが勝手に再起動した?はい、これは、 `live coding` と呼ばれる開発者のためのQuarkusの驚くべき機能の一つです。

source: Wait for Logs
ja_jp: ログを待機

source: Wait for Ports
ja_jp: ポートを待機

source: Wait on the returned `Uni` for the Kafka transaction to complete.
ja_jp: 返された `Uni` で Kafka トランザクションが完了するまで待ちます。

source: Wait until the batch is committed.
ja_jp: バッチがコミットされるまで待機します。

source: Waiting for a port to be open is another option. See the link:https://java.testcontainers.org/features/startup_and_waits/[Testcontainers documentation] for a full discussion on wait strategies.
ja_jp: ポートが開くのを待つという方法もあります。 待機方法については link:https://java.testcontainers.org/features/startup_and_waits/[Testcontainers のドキュメント] を参照してください。

source: Waiting for a port to be open is another option. See the link:https://java.testcontainers.org/features/startup_and_waits/[Testcontainers documentation] for a full discussion of wait strategies.
ja_jp: 別のオプションとして、ポートが開くのを待つことが挙げられます。待機ストラテジーの詳細は、link:https://java.testcontainers.org/features/startup_and_waits/[Testcontainers のドキュメント] を参照してください。

source: Waiting for the container to start
ja_jp: コンテナーの起動を待機する

source: Waiting until indexing is finished before launching the language servers.
ja_jp: 言語サーバーを起動する前に、インデックス作成が終了するまで待つ。

source: Walk-through
ja_jp: ウォークスルー

source: Wallpapers
ja_jp: 壁紙

source: Want a tour stop at your JUG?
ja_jp: あなたのJUGでツアーストップをしませんか？

source: Want to Get Involved?
ja_jp: 参加してみませんか？

source: Want to add a feature to the Dev UI? Just have a look at link:/guides/dev-ui[our Dev UI guide].
ja_jp: Dev UI に機能を追加したいですか? link:/guides/dev-ui[Dev UI ガイド] をご覧ください。

source: Want to get newsletters in your inbox? https://quarkus.io/newsletter[Sign up for the newsletter] using the on page form.
ja_jp: ニュースレターを受信してみませんか？ページ上のフォームを使って link:https://quarkus.io/newsletter[ニュースレターに登録]してください。

source: Want to get started on a Qute template on your own? Learn how https://quarkus.io/guides/qute#hello-world-with-jax-rs[here].
ja_jp: Quteのテンプレートを自分で始めてみたいですか？ 方法については link:https://quarkus.io/guides/qute#hello-world-with-jax-rs[こちら]を参照して下さい。

source: Want to have your extension added to the Quarkiverse?
ja_jp: 自分のエクステンションをQuarkiverseに追加したいですか？

source: Want to help present?
ja_jp: プレゼンのお手伝いをしてみませんか？

source: Want to learn more? Check out the <a href='/guides/'>guides</a> to continue your journey.
ja_jp: もっと詳しく知りたいですか? <a href='https://quarkus.io/guides/'>ガイド</a> を是非ご覧下さい。

source: Want to learn more? Check out the <a href='https://quarkus.io/guides/'>guides</a> to continue your journey
ja_jp: もっと詳しく知りたいですか? <a href='https://quarkus.io/guides/'>ガイド</a> を是非ご覧下さい。

source: Want to start a PostgreSQL server on the side with Docker?
ja_jp: PostgreSQLサーバをDockerで起動したいですか？

source: Want to try the benchmarks at home?
ja_jp: 自宅でベンチマークを試してみたいですか？

source: Warn or fail if an application.yaml is provided without the `quarkus-config-yaml` dependency https://github.com/quarkusio/quarkus/issues/13227[#13227]
ja_jp: `quarkus-config-yaml` の依存関係なしで application.yaml が提供された場合、警告または失敗する link:https://github.com/quarkusio/quarkus/issues/13227[#13227]

source: Warning: The gRPC client integration does not support statistic-based load balancers.
ja_jp: 注意: gRPCクライアント統合は、統計ベースのロードバランサーをサポートしていません。

source: Warning: When implementing your own `WebAuthnUserProvider.store` method, make sure that you never allow creating new credentials for a `username` that already exists. Otherwise you risk allowing third-parties to impersonate existing users by letting them add their own credentials to existing accounts. If you want to allow existing users to register more than one WebAuthn credential, you must make sure in `WebAuthnUserProvider.store` that the user is currently logged in under the same `username` to which you want to add new credentials. In every other case, make sure to return a failed `Uni` from this method. In this particular example, this is checked using a unicity constraint on the user name, which will cause the transaction to fail if the user already exists.
ja_jp: 警告: 独自の `WebAuthnUserProvider.store` メソッドを実装する際は、既に存在する `username` に対して新しい認証情報の作成を 許可しないようにします。そうしないと、サードパーティーが既存ユーザーになりすまし、 自分の認証情報を既存のアカウントに追加できてしまうリスクがあります。 既存ユーザーが複数の WebAuthn 認証情報を登録できるようにしたい場合は、新しい認証情報を追加する際に、そのユーザーが現在同じ `username` でログインしていることを `WebAuthnUserProvider.store` 内で確認する必要があります。それ以外の場合は、このメソッドから失敗した `Uni` を必ず返してください。 この具体的な例では、ユーザー名に対する一意性制約を設けることでチェックを行っており、 すでに存在するユーザーに対して処理が実行されるとトランザクションが失敗するようになっています。

source: Watch a World Tour Stop
ja_jp: ワールド・ツアー・ストップを確認

source: Watch the <a href="https://www.youtube.com/watch?v=d9CSY8HuZ9U">Quarkus Insights episode about Pact and Quarkus</a> to learn more.
ja_jp: 詳しくは、<a href="https://www.youtube.com/watch?v=d9CSY8HuZ9U">Quarkus InsightsのPactとQuarkusに関するエピソード</a>をご覧ください。

source: Ways You Can Help
ja_jp: 協力できること

source: We configure the password mapper with the position of the password field in the `SELECT` fields and other information like salt, hash encoding, etc.
ja_jp: `SELECT` フィールドのパスワードフィールドの位置や、ソルト、ハッシュエンコードなどの情報を使って、パスワードマッパーを設定します。

source: We **__make the complex simple__** for our clients so, how can we do the same for our own development process?
ja_jp: 私たちはクライアントのために **__複雑なことをシンプルにし__** ますが、自分たちの開発プロセスでも同じことができるでしょうか？

source: We achieved this by introducing our own class loader, which, for example, keeps a `package name` -> `jar file` mapping in memory. It also includes additional optimizations, such as maintaining a full directory index for specific locations like `META-INF/services`. These are just a few examples of what this packaging does, but they should give you some context.
ja_jp: これを達成するために、独自のクラスローダーを導入しました。このクラスローダーは、たとえば、`package name` -> `jar file` マッピングをメモリーに保持します。また、`META-INF/services` のような特定の場所の完全なディレクトリーインデックスを維持するなど、追加の最適化も含まれています。これらはこのパッケージングが行うことのほんの一部ですが、いくつかの文脈を提供できるはずです。

source: We add the `quarkus-bootstrap-maven-plugin` to generate the Quarkus extension descriptor included into the runtime artifact which links it with the corresponding deployment artifact.
ja_jp: ランタイムアーティファクトに含まれる Quarkus 拡張記述子を生成するために `quarkus-bootstrap-maven-plugin` を追加し、これを対応するデプロイメントアーティファクトとリンクさせています。

source: We add the `quarkus-extension-maven-plugin` to generate the Quarkus extension descriptor included into the runtime artifact which links it with the corresponding deployment artifact.
ja_jp: `Quarkus-extension-maven-plugin` を追加して、ランタイムアーティファクトに含まれるQuarkusエクステンションディスクリプタを生成します。Quarkusエクステンションディスクリプタはランタイムアーティファクトを対応するデプロイメントアーティファクトとリンクさせるものです。

source: We add the `quarkus-extension-maven-plugin` to generate the Quarkus extension descriptor included into the runtime artifact, which links it with the corresponding deployment artifact.
ja_jp: `quarkus-extension-maven-plugin` を追加して、ランタイムアーティファクトに含まれる Quarkus エクステンションディスクリプターを生成します。これは、対応するデプロイメントアーティファクトとリンクします。

source: We add the `quarkus-extension-processor` to the compiler annotation processors.
ja_jp: コンパイラーのアノテーションプロセッサーに `quarkus-extension-processor` を追加します。

source: We add a `createServlet` method which returns a `ServletBuildItem` and annotate it with `@BuildStep`. Now, Quarkus will process this new task which will result in the bytecode generation of the Servlet registration at build time.
ja_jp: `ServletBuildItem` を返す `createServlet` メソッドを追加し、 `@BuildStep` でアノテーションを付けます。これで、Quarkus はこの新しいタスクを処理して、ビルド時にサーブレット登録のバイトコードを生成します。

source: We add the `cloudSqlInstance` additional JDBC property to configure the instance id.
ja_jp: インスタンスIDを構成するために、 `cloudSqlInstance` JDBCプロパティを追加しています。

source: We add the `socketFactory` additional JDBC property to configure the socket factory used to connect to Cloud SQL, this one is coming from the `postgres-socket-factory` dependency.
ja_jp: `socketFactory` additional JDBC プロパティを追加して、Cloud SQL への接続に使用するソケットファクトリを構成します。このプロパティは `postgres-socket-factory` の依存関係に由来します。

source: We added Kubernetes service binding support for the Reactive SQL Clients extensions.
ja_jp: Reactive SQL Clients エクステンションの Kubernetes サービスバインディングのサポートを追加しました。

source: We added another functionality - the application can return the amount of remaining packages of given coffee on our store (just a random number).
ja_jp: もう一つの機能を追加しました。このアプリケーションは、私たちの店における、指定されたコーヒーの残りのパッケージの量を返すことができます（単なる乱数です）。

source: We added experimental support for `mongo+srv://` in native executables (it was only working in JVM mode pre-2.7).
ja_jp: ネイティブ実行可能ファイルで `mongo+srv://` を実験的にサポートしました（2.7以前はJVMモードでのみ動作していました）。

source: We added several new guides:
ja_jp: 新しいガイドをいくつか追加しました。

source: We added some new functionality. We want to be able to recommend some related coffees based on a coffee that a user is currently looking at. It's not a critical functionality, it's a nice-to-have. When the system is overloaded and the logic behind obtaining recommendations takes too long to execute, we would rather time out and render the UI without recommendations.
ja_jp: いくつかの新しい機能を追加しました。ユーザーが現在見ているコーヒーに基づいて、関連するコーヒーをお勧めできるようにしたいのです。これは重要な機能ではなく、あれば望ましい機能です。システムに負荷がかかり、おすすめ情報を得るためのロジックの実行に時間がかかりすぎる場合は、むしろタイムアウトしておすすめ情報のないUIを表示したいと考えています。

source: We added support for headless AWT on Windows for native images to our AWT extension.
ja_jp: AWTエクステンションに、ネイティブイメージでのWindowsにおけるヘッドレスAWTのサポートを追加しました。

source: We added support for the Confluent Schema Registry and restructured the schema registry extensions for more flexibility.
ja_jp: Confluent Schema Registry のサポートを追加し、スキーマレジストリエクステンションを再構成して、より柔軟性を高めました。

source: We all know time zones are hard. But now we also know that loading them is slow.
ja_jp: タイムゾーンの扱いが難しいことは誰もが知っています。しかし今、私たちはそのロードも遅いということを知りました。

source: We already prepared examples for a dozen of extensions, you may spot them on https://code.quarkus.io[code.quarkus.io,role=external,window=_blank] (with the jet fighter icon).
ja_jp: 私たちはすでに沢山のエクステンションの例を用意しており、 https://code.quarkus.io[code.quarkus.io, role=external, window=_blank](ジェット戦闘機のアイコンが付いている)で見ることが出来ます。

source: We already presented the novelties of this version in the Alphas/CRs announcements but here is a summary of what's new in this version.
ja_jp: このバージョンの新しさは、すでにAlphas/CRの発表で紹介していますが、ここではその内容をまとめてみました。

source: We already see that `gdb` is able to tell us which method caused the crash and where it’s located in the source code. We can also get a backtrace of the call graph that led us to this state:
ja_jp: `gdb` は、どのメソッドがクラッシュの原因となったのか、それがソースコードのどこにあるのかを教えてくれることがすでにわかりました。また、この状態に至ったコールグラフのバックトレースも得ることができます。

source: We also added a `@CircuitBreaker` annotation with `requestVolumeThreshold = 4`. `CircuitBreaker.failureRatio` is by default 0.5, and `CircuitBreaker.delay` is by default 5 seconds. That means that a circuit breaker will open when 2 of the last 4 invocations failed and it will stay open for 5 seconds.
ja_jp: また、 `requestVolumeThreshold = 4` と一緒に `@CircuitBreaker` のアノテーションを追加しました。 `CircuitBreaker.failureRatio` はデフォルトで 0.5 秒、 `CircuitBreaker.delay` はデフォルトで 5 秒です。つまり、過去4回の起動のうち2回が失敗したときにサーキットブレーカーが開き、5秒間その状態が続くということです。

source: We also added a `@CircuitBreaker` annotation with `requestVolumeThreshold = 4`. `CircuitBreaker.failureRatio` is by default 0.5, and `CircuitBreaker.delay` is by default 5 seconds. That means that a circuit breaker will open when 2 of the last 4 invocations failed, and it will stay open for 5 seconds.
ja_jp: また、`@CircuitBreaker`アノテーションを追加し、`requestVolumeThreshold = 4`としました。`CircuitBreaker.failureRatio` はデフォルトで 0.5 で、 `CircuitBreaker.delay` はデフォルトで 5 秒です。つまり、過去4回の起動のうち2回が失敗した場合にサーキットブレーカーが開き、5秒間その状態のままになります。

source: We also added more metrics.
ja_jp: さらにメトリクスを追加しました。

source: We also added several RESTEasy Reactive counterpart extensions that were missing such as a RESTEasy Reactive-based Keycloak Admin Client extension or Hibernate RESTEasy Reactive REST Data with Panache.
ja_jp: また、RESTEasy ReactiveベースのKeycloak Admin ClientエクステンションやHibernate RESTEasy Reactive REST Data with Panacheなど、不足していたRESTEasy Reactive対応エクステンションをいくつか追加しています。

source: We also are going to need a simple resource with a `Keycloak` injected as request scoped CDI bean.
ja_jp: また、リクエストスコープのCDI Beanとして注入された `Keycloak` を持つ単純なリソースが必要になってきます。

source: We also can limit the service lookup to our namespace. We can also use the `all` value to look for services in all namespaces.
ja_jp: また、サービスの検索を自分のネームスペースに限定することもできます。また、 `all` の値を使用して、すべてのネームスペースのサービスを検索することもできます。

source: We also handle some basic date type transformations: all fields of type `Date`, `LocalDate`, `LocalDateTime` or `Instant` will be mapped to the link:https://docs.mongodb.com/manual/reference/bson-types/#date[BSON Date] using the `ISODate` type (UTC datetime). The MongoDB POJO codec doesn't support `ZonedDateTime` and `OffsetDateTime` so you should convert them prior usage.
ja_jp: また、基本的な日付型の変換も行います。 `Date`, `LocalDate`, `LocalDateTime` もしくは `Instant` 型のすべてのフィールドは、 `ISODate` 型 (UTC datetime) を使って link:https://docs.mongodb.com/manual/reference/bson-types/#date[BSON Date]にマッピングされます。MongoDB POJO コーデックは `ZonedDateTime` と `OffsetDateTime` をサポートしていないので、使う前に変換しておく必要があります。

source: We also have configured Quarkus to return the logged out user to the public `/hello/post-logout` resource, and this path is included in the logout request as the Auth0 specific `returnTo` query parameter. Finally, the Quarkus application's `client-id` is included in the logout URL as well.
ja_jp: また、ログアウトしたユーザーをパブリック `/hello/post-logout` リソースに返すように Quarkus を設定しました。このパスは、Auth0 固有の `returnTo` クエリーパラメーターとしてログアウトリクエストに含まれています。Quarkus アプリケーションの `client-id` もログアウト URL に含まれています。

source: We also include all components from the https://github.com/qomponent[Qomponent] library
ja_jp: https://github.com/qomponent[Qomponent] ライブラリーのすべてのコンポーネントも含まれています。

source: We also integrated AOT with the container image extensions (Jib, Docker, and Podman). When building a container image with AOT enabled, Quarkus:
ja_jp: また、AOT をコンテナーイメージエクステンション (Jib、Docker、Podman) と統合しました。AOT を有効にしてコンテナーイメージをビルドする際、Quarkus は次の処理を行います。

source: We also introduce two Quarkus dependencies in the `io.quarkus` group, `quarkus-vertx-http`, and `quarkus-qute` which provides https://quarkus.io/guides/qute[Qute Templating Engine] and replaces the Handlebars engine used in the <<vertx-oidc-vertx>> section.
ja_jp: また、 `io.quarkus` グループの 2 つの Quarkus 依存関係を導入しています。 `quarkus-vertx-http` と、 https://quarkus.io/guides/qute[Qute テンプレートエンジン] を提供し、 <<vertx-oidc-vertx>> セクションで使用されていた Handlebars エンジンを置き換える `quarkus-qute` です。

source: We also introduced a new RESTEasy Multipart extension to fix an recurring encoding issues with multipart.
ja_jp: また、新しい RESTEasy Multipart エクステンションを導入し、multipart で繰り返し発生するエンコーディングの問題を修正しました。

source: We also mark the Book type as an link:{hibernate-search-docs-url}#concepts-entity[entity type], but we don't use `@Indexed`, because we decided we don't need a dedicated index for books.
ja_jp: また、Book タイプを link:{hibernate-search-docs-url}#concepts-entity[エンティティータイプ] としてマークします。 しかし、book 専用のインデックスは必要ないと判断したため、 `@Indexed` は使用しません。

source: We also need a class that will contain the response sent to the users when they ask for the next three days weather forecast. Create `src/main/java/org/acme/cache/WeatherForecast.java` this way:
ja_jp: また、ユーザーが次の3日間の天気予報を求めたときに送信されるレスポンスを含むクラスも必要です。 `src/main/java/org/acme/cache/WeatherForecast.java` をこのように作成します:

source: We also need a class which contains the response sent to the users when they ask for the next three days weather forecast. Create `src/main/java/org/acme/spring/cache/WeatherForecast.java` this way:
ja_jp: また、ユーザーが3日間の天気予報を聞いてきたときに、ユーザーに送信されるレスポンスを含むクラスも必要です。 `src/main/java/org/acme/spring/cache/WeatherForecast.java` をこのように作成します:

source: We also need a second entity for the credentials:
ja_jp: また、クレデンシャルのための第二のエンティティが必要です:

source: We also need to decide on which topic we are going to send these records. Let's keep things simple and name our topic __movies__.
ja_jp: また、これらのレコードを送信するトピックを決める必要があります。単純化して、トピックを _movies_ としましょう。

source: We also need to safely store the encryption key. You shouldn't store the key with the rest of the secrets, so we can create another `KeyStore` for the key:
ja_jp: 暗号鍵を安全に保管する必要もあります。鍵は他のシークレットと一緒に保存すべきではありません。 そのため、鍵用に別の `KeyStore` を作成することが出来ます:

source: We also need to update the functional test to reflect the changes made to the endpoint. Create the `src/test/java/org/acme/config/GreetingResourceTest.java` file with the following content:
ja_jp: また、エンドポイントに加えられた変更を反映させるために、機能テストを更新する必要があります。 `src/test/java/org/acme/config/GreetingResourceTest.java` ファイルを以下の内容で作成します:

source: We also need to update the functional test to reflect the changes made to the endpoint. Edit the `src/test/java/org/acme/rest/client/ExtensionsResourceTest.java` file and change the content of the `testExtensionIdEndpoint` method to:
ja_jp: また、エンドポイントに加えられた変更を反映させるために、機能テストを更新する必要があります。 `src/test/java/org/acme/rest/client/ExtensionsResourceTest.java` ファイルを編集し、 `testExtensionIdEndpoint` メソッドの内容を変更します。

source: We also need to update the functional test to reflect the changes made to the endpoint. Edit the `src/test/java/org/acme/rest/client/multipart/MultipartClientResourceTest.java` file to:
ja_jp: また、エンドポイントに加えられた変更を反映させるために、機能テストを更新する必要があります。 `src/test/java/org/acme/rest/client/multipart/MultipartClientResourceTest.java` ファイルを下記のように編集します。

source: We also need to update the functional test to reflect the changes made to the endpoint. Edit the `src/test/java/org/acme/spring/di/GreetingResourceTest.java` file and change the content of the `testHelloEndpoint` method to:
ja_jp: また、エンドポイントに加えられた変更を反映させるために、機能テストを更新する必要があります。 `src/test/java/org/acme/spring/di/GreetingResourceTest.java` ファイルを編集し、 `testHelloEndpoint` メソッドの内容を次のように変更します。

source: We also need to update the tests. Edit the `CountResourceTest` class to match:
ja_jp: テストも更新する必要があります。 `CountResourceTest` クラスを一致するように編集します。

source: We also recommend setting `quarkus.http.insecure-requests` to `redirect` to redirect all HTTP requests to HTTPS. The ACME challenge accepts self-signed certificates and up to 10 redirections:
ja_jp: また、すべての HTTP リクエストを HTTPS にリダイレクトするために、`quarkus.http.insecure-requests` を `redirect` に設定することが推奨されます。 ACME チャレンジは、自己署名証明書と最大で 10 件のリダイレクトを受け入れます。

source: We also set the `java.util.logging.manager` system property to make sure tests will use the correct logmanager and `maven.home` to ensure that custom configuration from `${maven.home}/conf/settings.xml` is applied (if any).
ja_jp: また、テストが正しいログマネージャーを使用するように `java.util.logging.manager` システムプロパティーを設定し、 `${maven.home}/conf/settings.xml` からのカスタム設定 (存在する場合) が適用されるように `maven.home` も設定します。
